In [1]:
## import library
import pandas as pd

In [2]:
## set display code
pd.options.display.float_format = '{:,.0f}'.format

In [3]:
## import raw dataset 
raw_df = pd.read_excel("college-encampment-database.xlsx", sheet_name='6.18_workbook')
raw_df

,Unnamed: 0,college,demands,demand_scope,start_encampment,OLD-end-encampment,end_encampment,encampment_ongoing,OLD-encampment-size,size_encampment,...,share_full_tuition,anti_bds_state,city,state,region,school-colors,mascot,quotes,source,notes
0,Anna Leah,American University,"disclose investments, divestment, academic boy...",standard,2024-04-25,2024-05-07 00:00:00,2024-05-07,no,"300 (day 1, April 25, AU joined)",300,...,47% first-years receive financial aid,no,Washington,DC,NaN,"004FA2, E0263c",eagle,NaN,NaN,"Part of DC encampment, student government expr..."
1,Anna Leah,Arizona State University,"official statement of condemnation, disclose i...",broad,2024-04-26,2024-04-27 00:00:00,2024-04-27,no,400 (approximate),400,...,53% first-years receive financial aid,yes,Tempe,AZ,NaN,"8C1D40, FFC627, 000000, FFFFFF",Sparky the Sun Devil,"""Do not let them harass any police officers,"" ...",NaN,NaN
2,NaN,Auraria Campus Encampment (University of Color...,"divest, refusal of grants or funds from milita...",standard,2024-04-25,2024-05-10 00:00:00,2024-05-10,yes,100,100,...,"28.%, 42% of first-year students received need...",yes,Denver,CO,NaN,"CFB87C, 000000",Lynx,"""The public campus that houses Metropolitan St...",NaN,shares campus with Community College of Denver...
3,Anna Leah,Barnard College,"divest, remove NYPD from campus, reinstate SJP...",standard,2024-04-17,2024-04-30 00:00:00,2024-04-30,no,NaN,NaN,...,47% of first-year students received need-based...,yes,New York,NY,NaN,"012F6B, 9fC16D, 666666",Millie the Dancing Bear,NaN,NaN,protested at Columbia campus
4,Anna Leah,Berklee College of Music,"divest, disclose, academic boycott, land ackno...",standard,2024-04-25,2024-04-27 00:00:00,2024-04-27,no,100 (joined Northeastern University encampment),100,...,32% of first-year students received need-based...,no,Boston,MA,NaN,"D81118, 005587",Mingus the Jazz Cat,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
106,Sabir,Washington DC,NaN,NaN,NaT,NaN,NaT,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,https://www.udc.edu/\nI am not sure what this ...
107,Sabir,Washington University in St. Louis,"Divest, boycott, no policing,\nstop displaceme...",standard,2024-04-27,2024-04-27 00:00:00,2024-04-27,no,NaN,11,...,NaN,yes,St. Louis,MO,NaN,NaN,NaN,NaN,https://www.studlife.com/news/2024/04/27/prote...,NaN
108,Sabir,Wayne State University,NaN,NaN,NaT,NaN,NaT,NaN,NaN,NaN,...,NaN,yes,Detroit,MI,NaN,NaN,NaN,NaN,https://www.freep.com/story/news/local/michiga...,There is no info on encampements at Wayne Stat...
109,Sabir,Wesleyan University,"Disclose, Terminate, \nDivest, and Protect.",standard,2024-04-28,2024-05-15 00:00:00,2024-05-10,yes,NaN,100,...,NaN,no,Middletown,CT,NaN,NaN,NaN,NaN,https://newrepublic.com/article/181341/wesleya...,NaN
110,Sabir,Yale University,"Disclose, divest,\nReinvest.",broad,2024-04-20,2024-04-22 00:00:00,2024-04-22,no,NaN,40,...,NaN,no,New Haven,CT,NaN,NaN,NaN,NaN,https://yaledailynews.com/blog/2024/04/28/live...,Yale had a recuring encampment events. The num...

In [4]:
## duplicate raw data
df_analysis = raw_df

In [5]:
df_analysis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 43 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Unnamed: 0                  110 non-null    object
 1   college                     111 non-null    object
 2   demands                     101 non-null    object
 3   demand_scope                101 non-null    object
 4   start_encampment            104 non-null    datetime64[ns]
 5   OLD-end-encampment          79 non-null     object
 6   end_encampment              86 non-null     datetime64[ns]
 7   encampment_ongoing          86 non-null     object
 8   OLD-encampment-size         66 non-null     object
 9   size_encampment             68 non-null     float64
 10  length_encampment           89 non-null     float64
 11  OLD-protester-actions       46 non-null     object
 12  OLD-orgs-involved           57 non-null     object
 13  counterprotesters           49 non-null     object
 14  OLD-inst-response           31 non-null     object
 15  commencement_canceled       92 non-null     object
 16  OLD-university_response     73 non-null     object
 17  university_response         59 non-null     object
 18  arrested_students           67 non-null     object
 19  arrested_total              84 non-null     float64
 20  OLD-negotiated - notes      48 non-null     object
 21  negotiated                  64 non-null     object
 22  negotiation_date            23 non-null     datetime64[ns]
 23  negotiation_length          24 non-null     float64
 24  school_type                 109 non-null    object
 25  OLD-endowment               95 non-null     object
 26  endowment_size              83 non-null     float64
 27  undergrad_population        106 non-null    float64
 28  OLD-average                 40 non-null     object
 29  OLD-tuition                 104 non-null    object
 30  undergrad_tuition_instate   44 non-null     float64
 31  undergrad_tuition_outstate  42 non-null     float64
 32  undergrad_tuition_private   52 non-null     float64
 33  share_full_tuition          42 non-null     object
 34  anti_bds_state              109 non-null    object
 35  city                        109 non-null    object
 36  state                       109 non-null    object
 37  region                      0 non-null      float64
 38  school-colors               75 non-null     object
 39  mascot                      85 non-null     object
 40  quotes                      13 non-null     object
 41  source                      38 non-null     object
 42  notes                       53 non-null     object
dtypes: datetime64[ns](3), float64(10), object(30)
memory usage: 37.4+ KB

## convert all strings to numbers

In [6]:
## convert all other metrics to int
df_analysis[["endowment_size","size_encampment","length_encampment","arrested_total","undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private","undergrad_population"]]= df_analysis[["endowment_size","size_encampment","length_encampment","arrested_total","undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private","undergrad_population"]].astype("float")

# Step 5: Are there discernible differences among schools that have different scopes of demand?

## share of schools by demand

In [7]:
## value count of schools' commencement decisions
df_analysis.value_counts("demand_scope").to_frame("Demand scope")

              Demand scope
demand_scope
standard                49
broad                   26
narrow                  26

In [8]:
## share of schools that called the police
(df_analysis.value_counts("demand_scope", normalize = True)*100).to_frame("Demand scope")

              Demand scope
demand_scope
standard                49
broad                   26
narrow                  26

## create DFs for analysis

In [9]:
## create a separate DF to look at schools that have a broad scope
df_broad = df_analysis[["demand_scope","start_encampment","end_encampment","encampment_ongoing","size_encampment","length_encampment","counterprotesters","commencement_canceled","university_response","arrested_total","negotiated","negotiation_date","school_type","endowment_size","undergrad_population","undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private","anti_bds_state","state"]].query("demand_scope == 'broad'")
df_broad.sample(10)

,demand_scope,start_encampment,end_encampment,encampment_ongoing,size_encampment,length_encampment,counterprotesters,commencement_canceled,university_response,arrested_total,negotiated,negotiation_date,school_type,endowment_size,undergrad_population,undergrad_tuition_instate,undergrad_tuition_outstate,undergrad_tuition_private,anti_bds_state,state
16,broad,2024-04-23,2024-04-25,no,100,2,no,no,arrests,118,no,NaT,private,260,"4,149",NaN,NaN,"55,392",no,MA
74,broad,2024-04-29,2024-05-07,no,NaN,8,yes,no,arrests,0,yes,2024-05-03,private,"10,300","7,512",NaN,NaN,"63,801",yes,IL
21,broad,2024-04-25,2024-05-08,no,300,13,no,no,off campus,33,no,NaT,private,192,914,NaN,NaN,"18,254",no,DC
7,broad,2024-04-22,2024-04-30,no,50,8,yes,no,arrests,31,yes,NaT,public,42,"5,858",NaN,NaN,NaN,yes,CA
14,broad,2024-04-30,2024-05-10,yes,200,10,yes,no,dismantled,0,yes,2024-05-06,private,825,"14,134",NaN,NaN,"44,460",yes,IL
60,broad,2024-04-29,2024-05-10,yes,100,11,yes,no,let stand,2,no,NaT,private,"1,850","22,000",NaN,NaN,"61,310",yes,NY
53,broad,2024-04-29,2024-05-03,no,NaN,NaN,NaN,no,NaN,NaN,success,NaT,public,"1,980","36,344","17,239","36,001",NaN,yes,NJ
110,broad,2024-04-20,2024-04-22,no,40,2,NaN,no,arrests,48,NaN,NaT,private,NaN,"6,645",NaN,NaN,"64,700",no,CT
1,broad,2024-04-26,2024-04-27,no,400,1,yes,no,arrests,69,NaN,NaT,public,"1,500","114,484",NaN,NaN,NaN,yes,AZ
85,broad,2024-04-22,2024-05-10,yes,24,18,yes,no,arrests,7,no,NaT,public,589,"15,914","27,514","50,433",NaN,no,NM

In [10]:
## create a separate DF to look at schools that have a standard scope
df_standard = df_analysis[["demand_scope","start_encampment","end_encampment","encampment_ongoing","size_encampment","length_encampment","counterprotesters","commencement_canceled","university_response","arrested_total","negotiated","negotiation_date","school_type","endowment_size","undergrad_population","undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private","anti_bds_state","state"]].query("demand_scope == 'standard'")
df_standard.sample(10)

,demand_scope,start_encampment,end_encampment,encampment_ongoing,size_encampment,length_encampment,counterprotesters,commencement_canceled,university_response,arrested_total,negotiated,negotiation_date,school_type,endowment_size,undergrad_population,undergrad_tuition_instate,undergrad_tuition_outstate,undergrad_tuition_private,anti_bds_state,state
28,standard,2024-04-25,2024-05-08,no,300,13,NaN,yes,off campus,NaN,NaN,NaT,private,865,"9,809",NaN,NaN,"33,344",no,DC
9,standard,2024-04-17,2024-04-30,no,NaN,13,no,no,arrests,109,yes,2024-04-23,private,"13,640","8,832",NaN,NaN,"65,524",yes,NY
12,standard,2024-04-29,2024-05-08,no,30,9,NaN,no,let stand,0,success,NaT,public,109,"28,389",NaN,NaN,NaN,yes,CA
100,standard,2024-04-29,2024-05-10,yes,40,11,NaN,no,NaN,0,yes,NaT,public,233,"18,751","9,650","21,514",NaN,yes,WI
92,standard,2024-04-23,2024-05-10,yes,36,17,NaN,no,arrests,2,no,NaT,private,"3,600","6,767",NaN,NaN,"64,384",yes,NY
82,standard,2024-05-06,2024-05-07,no,NaN,1,no,no,arrests,132,yes,2024-05-07,public,507,"24,231","32,794","54,730",NaN,no,MA
3,standard,2024-04-17,2024-04-30,no,NaN,13,no,no,off campus,109,NaN,NaT,private,460,"3,442",NaN,NaN,"66,246",yes,NY
38,standard,2024-04-28,2024-05-06,no,NaN,8,NaN,no,NaN,NaN,yes,2024-05-06,private,"1,469","2,773",NaN,NaN,"65,280",no,VT
104,standard,2024-04-29,2024-04-30,no,NaN,1,NaN,no,NaN,13,NaN,NaT,public,NaN,"20,958","16,353","38,247",NaN,yes,VA
72,standard,2024-04-26,2024-05-02,no,"1,000",6,yes,no,arrests,209,no,NaT,public,NaN,"33,040","15,154","57,281",NaN,no,CA

In [11]:
## create a separate DF to look at schools that have a narrow scope
df_narrow = df_analysis[["demand_scope","start_encampment","end_encampment","encampment_ongoing","size_encampment","length_encampment","counterprotesters","commencement_canceled","university_response","arrested_total","negotiated","negotiation_date","school_type","endowment_size","undergrad_population","undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private","anti_bds_state","state"]].query("demand_scope == 'narrow'")
df_narrow.sample(10)

,demand_scope,start_encampment,end_encampment,encampment_ongoing,size_encampment,length_encampment,counterprotesters,commencement_canceled,university_response,arrested_total,negotiated,negotiation_date,school_type,endowment_size,undergrad_population,undergrad_tuition_instate,undergrad_tuition_outstate,undergrad_tuition_private,anti_bds_state,state
47,narrow,2024-05-08,NaT,NaN,NaN,NaN,NaN,no,NaN,43,NaN,NaT,private,394,"7,208",NaN,NaN,"56,244",no,NY
33,narrow,2024-04-29,2024-05-01,no,NaN,2,NaN,no,NaN,NaN,NaN,NaT,private,972,"11,703",NaN,NaN,"51,706",yes,MD
29,narrow,2024-04-25,NaT,NaN,NaN,NaN,NaN,no,arrests,33,NaN,NaT,public,"3,558","35,660","11,790","40,482",NaN,yes,IN
25,narrow,2024-04-26,NaT,NaN,20,NaN,no,no,let stand,0,yes,2024-04-26,private,101,"1,925",NaN,NaN,"49,031",yes,MN
40,narrow,2024-04-26,NaT,NaN,NaN,NaN,NaN,no,NaN,36,NaN,NaT,public,"5,160","26,254","9,105","31,976",NaN,yes,NC
49,narrow,2024-04-25,NaT,NaN,NaN,NaN,NaN,no,NaN,13,NaN,NaT,private,"34,100","5,604",NaN,NaN,"59,710",no,NJ
55,narrow,2024-03-27,2024-04-09,no,50,13,no,no,let stand,0,yes,2024-03-30,private,"2,500","2,500",NaN,NaN,"64,870",no,MA
27,narrow,2024-04-25,2024-05-10,yes,NaN,15,no,no,let stand,NaN,NaN,NaT,private,643,"1,421",NaN,NaN,"68,020",no,PA
18,narrow,2024-04-25,2024-05-08,no,100,13,no,no,arrests,25,yes,NaT,public,NaN,"7,872",NaN,NaN,NaN,yes,NY
45,narrow,2024-04-29,NaT,NaN,NaN,NaN,NaN,no,NaN,4,yes,2024-05-10,private,576,"1,942",NaN,NaN,"63,446",no,CA

## find top states for each

In [12]:
## find top states for each - broad
df_broad["state"].value_counts(ascending = False).to_frame("Total schools - broad")

       Total schools - broad
state
NY                         4
CA                         3
AZ                         2
MA                         2
DC                         2
IL                         2
GA                         1
FL                         1
OH                         1
IN                         1
TX                         1
NJ                         1
PA                         1
MD                         1
NM                         1
NC                         1
CT                         1

In [13]:
## find top states for each - standard
df_standard["state"].value_counts(ascending = False).to_frame("Total schools - standard")

       Total schools - standard
state
CA                            7
NY                            6
DC                            3
TX                            3
MA                            3
VA                            3
CO                            3
VT                            2
NC                            2
FL                            2
WI                            2
PA                            2
MO                            1
TN                            1
WA                            1
UT                            1
GA                            1
IN                            1
MI                            1
MD                            1
LA                            1
OH                            1
CT                            1

In [14]:
## find top states for each - narrow
df_narrow["state"].value_counts(ascending = False).to_frame("Total schools - narrow")

       Total schools - narrow
state
PA                          3
MA                          3
CA                          3
NY                          2
MN                          2
MD                          2
OH                          2
IL                          2
RI                          1
IN                          1
LA                          1
MI                          1
NC                          1
NJ                          1
CT                          1

## public v. private split

In [15]:
## find public v. private split for each - broad
(df_broad.value_counts("school_type", normalize = True)*100).to_frame("Public v. Private - broad")

             Public v. Private - broad
school_type
private                             54
public                              46

In [16]:
## find public v. private split for each - standard
(df_standard.value_counts("school_type", normalize = True)*100).to_frame("Public v. Private - standard")

                              Public v. Private - standard
school_type
public                                                  59
private                                                 39
private, federally chartered                             2

In [17]:
## find public v. private split for each - narrow
(df_narrow.value_counts("school_type", normalize = True)*100).to_frame("Public v. Private - narrow")

             Public v. Private - narrow
school_type
private                              58
public                               42

## mean, median, max and min endowment size

In [18]:
## find mean, median, max, min endowment size - broad
df_broad["endowment_size"].agg(["mean", "median", "max", "min"]).to_frame("Endowment size - broad")

        Endowment size - broad
mean                     4,472
median                   1,500
max                     36,500
min                          2

In [19]:
## find mean, median, max, min endowment size - standard
df_standard["endowment_size"].agg(["mean", "median", "max", "min"]).to_frame("Endowment size - standard")

        Endowment size - standard
mean                        4,753
median                      1,199
max                        49,495
min                            20

In [20]:
## find mean, median, max, min endowment size - narrow
df_narrow["endowment_size"].agg(["mean", "median", "max", "min"]).to_frame("Endowment size - narrow")

        Endowment size - narrow
mean                      5,289
median                    2,020
max                      34,100
min                         101

## mean, median, max and min tuition

In [21]:
## find mean, median, max, min tuition - broad
df_broad[["undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private"]].agg(["mean", "median", "max", "min"])

,undergrad_tuition_instate,undergrad_tuition_outstate,undergrad_tuition_private
mean,"12,312","36,448","58,079"
median,"11,505","36,300","61,982"
max,"27,514","50,433","66,358"
min,"3,465","21,338","18,254"

In [22]:
## find mean, median, max, min tuition - standard
df_standard[["undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private"]].agg(["mean", "median", "max", "min"])

,undergrad_tuition_instate,undergrad_tuition_outstate,undergrad_tuition_private
mean,"12,872","35,795","55,579"
median,"11,602","38,247","63,468"
max,"32,794","57,281","68,678"
min,"3,510","17,324","5,742"

In [23]:
## find mean, median, max, min tuition - narrow
df_narrow[["undergrad_tuition_instate","undergrad_tuition_outstate","undergrad_tuition_private"]].agg(["mean", "median", "max", "min"])

,undergrad_tuition_instate,undergrad_tuition_outstate,undergrad_tuition_private
mean,"16,386","39,564","58,270"
median,"12,485","38,127","62,626"
max,"36,938","59,050","68,230"
min,"9,105","28,631","12,522"

## mean, median, max and min encampment length

In [24]:
## find mean, median, max, min encampment length - broad
df_broad["length_encampment"].agg(["mean", "median", "max", "min"]).to_frame("Encampment length - broad")

        Encampment length - broad
mean                           10
median                         10
max                            29
min                             0

In [25]:
## find mean, median, max, min encampment length - standard
df_standard["length_encampment"].agg(["mean", "median", "max", "min"]).to_frame("Encampment length - standard")

        Encampment length - standard
mean                               9
median                            11
max                               40
min                                0

In [26]:
## find mean, median, max, min encampment length - narrow
df_narrow["length_encampment"].agg(["mean", "median", "max", "min"]).to_frame("Encampment length - narrow")

        Encampment length - narrow
mean                            11
median                          13
max                             19
min                              2

## mean, median, max and min encampment size

In [27]:
## find mean, median, max, min encampment size - broad
df_broad["size_encampment"].agg(["mean", "median", "max", "min"]).to_frame("Encampment size - broad")

        Encampment size - broad
mean                        160
median                      125
max                         450
min                          24

In [28]:
## find mean, median, max, min encampment size - standard
df_standard["size_encampment"].agg(["mean", "median", "max", "min"]).to_frame("Encampment size - standard")

        Encampment size - standard
mean                           162
median                          49
max                          1,000
min                              0

In [29]:
## find mean, median, max, min encampment size - narrow
df_narrow["size_encampment"].agg(["mean", "median", "max", "min"]).to_frame("Encampment size - narrow")

        Encampment size - narrow
mean                          65
median                        50
max                          200
min                           12

## mean, median, max and min arrested total

In [30]:
## find mean, median, max, min arrested total - broad
df_broad["arrested_total"].agg(["mean", "median", "max", "min"]).to_frame("Total arrests - broad")

        Total arrests - broad
mean                       26
median                      4
max                       173
min                         0

In [31]:
## find mean, median, max, min arrested total - standard
df_standard["arrested_total"].agg(["mean", "median", "max", "min"]).to_frame("Total arrests - standard")

        Total arrests - standard
mean                          39
median                        16
max                          209
min                            0

In [32]:
## find mean, median, max, min arrested total - narrow
df_narrow["arrested_total"].agg(["mean", "median", "max", "min"]).to_frame("Total arrests - narrow")

        Total arrests - narrow
mean                        23
median                      19
max                        103
min                          0

## mean, median, max and min undergrad population

In [33]:
## find mean, median, max, min arrested total - broad
df_broad["undergrad_population"].agg(["mean", "median", "max", "min"]).to_frame("Undergrad population - broad")

        Undergrad population - broad
mean                          24,117
median                        14,134
max                          162,347
min                              914

In [34]:
## find mean, median, max, min arrested total - standard
df_standard["undergrad_population"].agg(["mean", "median", "max", "min"]).to_frame("Undergrad population - standard")

        Undergrad population - standard
mean                             27,499
median                           19,743
max                             368,722
min                               2,050

In [35]:
## find mean, median, max, min arrested total - narrow
df_narrow["undergrad_population"].agg(["mean", "median", "max", "min"]).to_frame("Undergrad population - narrow")

        Undergrad population - narrow
mean                           16,246
median                         10,181
max                            46,123
min                             1,212

## share of schools that had counter protesters

In [36]:
## find share of schools that had negotiations - broad
(df_broad.value_counts("counterprotesters", normalize = True)*100).to_frame("Had counterprotesters? - broad")

                   Had counterprotesters? - broad
counterprotesters
no                                             53
yes                                            47

In [37]:
## find share of schools that had negotiations - standard
(df_standard.value_counts("counterprotesters", normalize = True)*100).to_frame("Had counterprotesters? - standard")

                   Had counterprotesters? - standard
counterprotesters
no                                                65
yes                                               35

In [38]:
## find share of schools that had negotiations - narrow
(df_narrow.value_counts("counterprotesters", normalize = True)*100).to_frame("Had counterprotesters? - narrow")

                   Had counterprotesters? - narrow
counterprotesters
no                                              80
yes                                             20

## share of schools that are in states with anti-BDS laws

In [39]:
## find share of schools that had negotiations - broad
(df_broad.value_counts("anti_bds_state", normalize = True)*100).to_frame("Anti BDS law? - broad")

                Anti BDS law? - broad
anti_bds_state
yes                                65
no                                 35

In [40]:
## find share of schools that had negotiations - standard
(df_standard.value_counts("anti_bds_state", normalize = True)*100).to_frame("Anti BDS law? - standard")

                Anti BDS law? - standard
anti_bds_state
yes                                   63
no                                    37

In [41]:
## find share of schools that had negotiations - narrow
(df_narrow.value_counts("anti_bds_state", normalize = True)*100).to_frame("Anti BDS law? - narrow")

                Anti BDS law? - narrow
anti_bds_state
no                                  54
yes                                 46

## share of schools with arrested students

In [42]:
## find share of schools with arrested students - broad
(df_broad.value_counts("university_response", normalize = True)*100).to_frame("School response - broad")

                     School response - broad
university_response
arrests                                   50
discipline threat                         22
let stand                                 17
dismantled                                 6
off campus                                 6

In [43]:
## find share of schools with arrested students - standard
(df_standard.value_counts("university_response", normalize = True)*100).to_frame("School response - standard")

                     School response - standard
university_response
arrests                                      62
off campus                                   21
let stand                                    14
agreed                                        3

In [44]:
## find share of schools with arrested students - narrow
(df_narrow.value_counts("university_response", normalize = True)*100).to_frame("School response - narrow")

                     School response - narrow
university_response
let stand                                  50
arrests                                    40
discipline threat                          10